import React from 'react'
import { Table } from 'react-bootstrap';


const Rule = (props) => (
    <div className="tab-content-scroll">
        <h5 ><b>缤纷春季擂台赛首奖 80,000 人民币等着您来赢取。</b></h5>
        <p>缤纷春季擂台赛将会于3月21日早上8时至3月28日早上8时间进行。奖金会在赛事结束后的2个小时内自动进账到会员结存。系统将针对上述擂台赛期间进行指定游戏的玩家进行排榜。</p>
        <h5 ><b>擂台有什么游戏？</b></h5>
        <p>下列游戏(网页版，手机版和下载版)都可以贡献擂台点数</p>
        <p>
        </p>
        <ul>
            <li>Wild Orient(东方珍兽)</li>
            <li>Bikini Party(比基尼派对)</li>
            <li>Dragon Dance(舞龙)</li>
            <li>Lucky Twins(幸运双星)</li>
            <li>Carnaval(狂欢节)</li>
        </ul>
        <p></p>
        <h5 ><b>如何赢得擂台点数?</b></h5>
        <p>您在上述游戏所下注的每五百人民币将贡献1个擂台点数。</p>
        <p>您在上述游戏所赢取的每一百民币将贡献1个擂台点数。</p>

        <p>每日的排行是根据当日的数据计分。擂台点数最高者为榜首。当日榜首得500分。第二位到第二十位（每位）的得分是250, 以此类推。</p>
        <p>前日所得擂台点数不在次日的计分范围。赛事终了日累计得分最高者为首奖优胜者。依次排序。每日排榜列表如下：</p>
        <Table >
            <thead>
            <tr>
                <th colSpan={2} >排行榜</th>
                <th class="text-center">得分</th>
            </tr>
            </thead>
            <tbody class="text-right">
            <tr>
                <td>1</td>
                <td>到&nbsp;1</td>
                <td>500</td>
            </tr>
            <tr>
                <td>2</td>
                <td>到&nbsp;20</td>
                <td>250</td>
            </tr>
            <tr>
                <td>21</td>
                <td>到&nbsp;50</td>
                <td>100</td>
            </tr>
            <tr>
                <td>51</td>
                <td>到&nbsp;100</td>
                <td>50</td>
            </tr>
            <tr>
                <td>101</td>
                <td>到&nbsp;1000</td>
                <td>10</td>
            </tr>
            </tbody>
        </Table>

        <h5 ><b>排行榜会更新频率?</b></h5>
        <p>排行榜每15分钟更新一次. 每天的08.00AM(GMT+8)会重新开始计算擂台点数.</p>
        <h5 ><b>声明:</b></h5>
        <p>接近擂台赛结束时间的注单数据会花一些时间陆续写入到我方的数据库, 系统将根据最终数据统计计算排名.</p>
        <p>所以擂台赛的排名有可能在擂台赛结束后和最终结果有些出入, 请以我方最后公告的赢家”别名”为唯一依据.谢谢理解。</p>
        <blockquote>
            <footer > 当玩家出现相同的点数的情形时, 额外的参数如玩家在擂台赛内的赔出次数，赔出金额，下注金额以及下注数量将会纳入考虑来区分该玩家的排名.</footer>
        </blockquote>
        <br />
        <p>
            <b>系统故障或是网络问题导致比赛无法顺利进行,我们有权随时取消比赛。</b>
        </p>
        <p>
            <b>如果发现玩家有任何作弊行为我们有权取消玩家比赛资格及奖金。</b>
        </p>
        <p>
            <b>我们保留最终决定以及变更之权利。</b>
        </p>
        <p>
            <b>总社/主代理/代理相关工作人员禁止参加任何的擂台赛。</b>
        </p>
    </div>
)

export default Rule